{
    "id": "2182",
    "identity": {
        "ancestor_ids": [
            "1600",
            "1528"
        ],
        "error": null,
        "experiment_version": "jenkinsfull.dl.weekend.fresh.chestxray.21",
        "id": "2182",
        "unique_id": "2182"
    },
    "interpretation": {
        "description": {
            "toolkit": "Keras"
        },
        "global_hyperparameters": {
            "id": "2182",
            "learning_rate": 0.00015683484927109815
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Functional",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_01_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_02_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_03_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_04_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_05_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_06_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_07_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_08_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_09_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_10_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_11_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_12_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_13_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "name": "input_task_01_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_01_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "name": "input_task_02_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_02_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "name": "input_task_03_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_03_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "name": "input_task_04_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_04_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "name": "input_task_05_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_05_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "name": "input_task_06_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_06_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "name": "input_task_07_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_07_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "name": "input_task_08_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_08_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "name": "input_task_09_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_09_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "name": "input_task_10_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_10_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "name": "input_task_11_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_11_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "name": "input_task_12_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_12_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "name": "input_task_13_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_13_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_00_term_00",
                            "target_shape": [
                                224,
                                224,
                                3,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_00_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_01_term_00",
                            "target_shape": [
                                224,
                                224,
                                3,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_01_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_01_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_02_term_00",
                            "target_shape": [
                                224,
                                224,
                                3,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_02_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_02_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_03_term_00",
                            "target_shape": [
                                224,
                                224,
                                3,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_03_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_03_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_04_term_00",
                            "target_shape": [
                                224,
                                224,
                                3,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_04_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_04_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_05_term_00",
                            "target_shape": [
                                224,
                                224,
                                3,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_05_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_05_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_06_term_00",
                            "target_shape": [
                                224,
                                224,
                                3,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_06_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_06_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_07_term_00",
                            "target_shape": [
                                224,
                                224,
                                3,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_07_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_07_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_08_term_00",
                            "target_shape": [
                                224,
                                224,
                                3,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_08_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_08_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_09_term_00",
                            "target_shape": [
                                224,
                                224,
                                3,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_09_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_09_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_10_term_00",
                            "target_shape": [
                                224,
                                224,
                                3,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_10_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_10_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_11_term_00",
                            "target_shape": [
                                224,
                                224,
                                3,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_11_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_11_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_12_term_00",
                            "target_shape": [
                                224,
                                224,
                                3,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_12_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_12_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_13_term_00",
                            "target_shape": [
                                224,
                                224,
                                3,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_13_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_13_term_00"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_1120",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    54
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_1120"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_1121",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    54
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_01_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_1121"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_1122",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    54
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_02_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_1122"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_1123",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    54
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_03_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_1123"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_1124",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    54
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_04_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_1124"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_1125",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    54
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_05_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_1125"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_1126",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    54
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_06_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_1126"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_1127",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    54
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_07_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_1127"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_1128",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    54
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_08_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_1128"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_1129",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    54
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_09_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_1129"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_1130",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    54
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_10_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_1130"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_1131",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    54
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_11_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_1131"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_1132",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    54
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_12_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_1132"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_1133",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    54
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_13_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_1133"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape2_enc_task_00_term_00",
                            "target_shape": [
                                224,
                                224,
                                57
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "zero_padding3d_1120",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape2_enc_task_00_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape2_enc_task_01_term_00",
                            "target_shape": [
                                224,
                                224,
                                57
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "zero_padding3d_1121",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape2_enc_task_01_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape2_enc_task_02_term_00",
                            "target_shape": [
                                224,
                                224,
                                57
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "zero_padding3d_1122",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape2_enc_task_02_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape2_enc_task_03_term_00",
                            "target_shape": [
                                224,
                                224,
                                57
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "zero_padding3d_1123",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape2_enc_task_03_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape2_enc_task_04_term_00",
                            "target_shape": [
                                224,
                                224,
                                57
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "zero_padding3d_1124",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape2_enc_task_04_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape2_enc_task_05_term_00",
                            "target_shape": [
                                224,
                                224,
                                57
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "zero_padding3d_1125",
                                    0,
