{
    "id": "2687",
    "identity": {
        "ancestor_ids": [
            "2638",
            "2586"
        ],
        "error": null,
        "experiment_version": "garrett_mnist_high_performance_config_202105100822",
        "id": "2687",
        "unique_id": "2687"
    },
    "interpretation": {
        "description": {
            "toolkit": "Keras"
        },
        "global_hyperparameters": {
            "id": "2687",
            "learning_rate": 0.0004019789436782748
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Functional",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                28,
                                28,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_00_term_00",
                            "target_shape": [
                                28,
                                28,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_00_term_00"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_188",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    39
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_188"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape2_enc_task_00_term_00",
                            "target_shape": [
                                28,
                                28,
                                40
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "zero_padding3d_188",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape2_enc_task_00_term_00"
                    },
                    {
                        "class_name": "Functional",
                        "config": {
                            "input_layers": [
                                [
                                    "input_8486",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            28,
                                            28,
                                            40
                                        ],
                                        "dtype": "float32",
                                        "name": "input_8486",
                                        "ragged": false,
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_8486"
                                },
                                {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "activation": "relu",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "dtype": "float32",
                                        "filters": 40,
                                        "groups": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "HeNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L2",
                                            "config": {
                                                "l2": 1.1931841470413929e-07
                                            }
                                        },
                                        "kernel_size": [
                                            3,
                                            3
                                        ],
                                        "name": "layer_3_Conv2D_0",
                                        "padding": "same",
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_8486",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_Conv2D_0"
                                },
                                {
                                    "class_name": "Dropout",
                                    "config": {
                                        "dtype": "float32",
                                        "name": "layer_3_Dropout_1",
                                        "noise_shape": null,
                                        "rate": 0.023063807342650334,
                                        "seed": null,
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_Conv2D_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_Dropout_1"
                                },
                                {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "dtype": "float32",
                                        "filters": 40,
                                        "groups": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "GlorotUniform",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L2",
                                            "config": {
                                                "l2": 2.15102409129031e-06
                                            }
                                        },
                                        "kernel_size": [
                                            1,
                                            1
                                        ],
                                        "name": "Conv2D",
                                        "padding": "same",
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_Dropout_1",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv2D"
                                },
                                {
                                    "class_name": "MaxPooling2D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "dtype": "float32",
                                        "name": "MaxPooling2D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2,
                                            2
                                        ],
                                        "strides": [
                                            2,
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv2D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling2D"
                                }
                            ],
                            "name": "model_18_module_1077_20_6",
                            "output_layers": [
                                [
                                    "MaxPooling2D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape2_enc_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_18_module_1077_20_6"
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "activation": "linear",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "dtype": "float32",
                            "filters": 61,
                            "groups": 1,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "name": "conv2d_2949",
                            "padding": "same",
                            "strides": [
                                1,
                                1
                            ],
                            "trainable": true,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_18_module_1077_20_6",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "conv2d_2949"
                    },
                    {
                        "class_name": "Functional",
                        "config": {
                            "input_layers": [
                                [
                                    "input_8510",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            14,
                                            14,
                                            61
                                        ],
                                        "dtype": "float32",
                                        "name": "input_8510",
                                        "ragged": false,
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_8510"
                                },
                                {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "activation": "relu",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "dtype": "float32",
                                        "filters": 61,
                                        "groups": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "HeNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L2",
                                            "config": {
                                                "l2": 1.1931841470413929e-07
                                            }
                                        },
                                        "kernel_size": [
                                            3,
                                            3
                                        ],
                                        "name": "layer_3_Conv2D_0",
                                        "padding": "same",
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_8510",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_Conv2D_0"
                                },
                                {
                                    "class_name": "Dropout",
                                    "config": {
                                        "dtype": "float32",
                                        "name": "layer_3_Dropout_1",
                                        "noise_shape": null,
                                        "rate": 0.023063807342650334,
                                        "seed": null,
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_Conv2D_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_Dropout_1"
                                },
                                {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "dtype": "float32",
                                        "filters": 61,
                                        "groups": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "GlorotUniform",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L2",
                                            "config": {
                                                "l2": 2.15102409129031e-06
                                            }
                                        },
                                        "kernel_size": [
                                            1,
                                            1
                                        ],
                                        "name": "Conv2D",
                                        "padding": "same",
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_Dropout_1",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv2D"
                                },
                                {
                                    "class_name": "MaxPooling2D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "dtype": "float32",
                                        "name": "MaxPooling2D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2,
                                            2
                                        ],
                                        "strides": [
                                            2,
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv2D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling2D"
                                }
                            ],
                            "name": "model_42_module_1077_49_7",
                            "output_layers": [
                                [
                                    "MaxPooling2D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_2949",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_42_module_1077_49_7"
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "activation": "linear",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "dtype": "float32",
                            "filters": 40,
                            "groups": 1,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "name": "conv2d_2951",
                            "padding": "same",
                            "strides": [
                                1,
                                1
                            ],
                            "trainable": true,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_42_module_1077_49_7",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "conv2d_2951"
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "maxpool_task_00_node_14_block_01",
                            "padding": "valid",
                            "pool_size": [
                                4,
                                4
                            ],
                            "strides": [
                                4,
                                4
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape2_enc_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "maxpool_task_00_node_14_block_01"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "dtype": "float32",
                            "name": "add_softmod_task_00_node_14",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_2951",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "maxpool_task_00_node_14_block_01",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_softmod_task_00_node_14"
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "activation": "linear",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "dtype": "float32",
                            "filters": 94,
                            "groups": 1,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "name": "conv2d_2952",
                            "padding": "same",
                            "strides": [
                                1,
                                1
                            ],
                            "trainable": true,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_softmod_task_00_node_14",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "conv2d_2952"
                    },
                    {
                        "class_name": "Functional",
                        "config": {
                            "input_layers": [
                                [
                                    "input_8517",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            7,
                                            7,
                                            94
                                        ],
                                        "dtype": "float32",
                                        "name": "input_8517",
                                        "ragged": false,
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_8517"
                                },
                                {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "dtype": "float32",
                                        "filters": 94,
                                        "groups": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "GlorotUniform",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L2",
                                            "config": {
                                                "l2": 2.15102409129031e-06
                                            }
                                        },
                                        "kernel_size": [
                                            1,
                                            1
                                        ],
                                        "name": "Conv2D",
                                        "padding": "same",
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_8517",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv2D"
                                },
                                {
                                    "class_name": "MaxPooling2D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "dtype": "float32",
                                        "name": "MaxPooling2D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2,
                                            2
                                        ],
                                        "strides": [
                                            2,
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv2D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling2D"
                                }
                            ],
                            "name": "model_49_module_2648_2_14",
                            "output_layers": [
                                [
                                    "MaxPooling2D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_2952",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_49_module_2648_2_14"
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "activation": "linear",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "dtype": "float32",
                            "filters": 145,
                            "groups": 1,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "name": "conv2d_2953",
                            "padding": "same",
                            "strides": [
                                1,
                                1
                            ],
                            "trainable": true,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_49_module_2648_2_14",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "conv2d_2953"
                    },
                    {
                        "class_name": "Functional",
                        "config": {
                            "input_layers": [
                                [
                                    "input_8541",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            3,
                                            3,
                                            145
                                        ],
                                        "dtype": "float32",
                                        "name": "input_8541",
                                        "ragged": false,
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_8541"
                                },
                                {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "dtype": "float32",
                                        "filters": 145,
                                        "groups": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "GlorotUniform",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L2",
                                            "config": {
                                                "l2": 2.15102409129031e-06
                                            }
                                        },
                                        "kernel_size": [
                                            1,
                                            1
                                        ],
                                        "name": "Conv2D",
                                        "padding": "same",
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_8541",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv2D"
                                }
                            ],
                            "name": "model_73_module_2648_2_8",
                            "output_layers": [
                                [
                                    "Conv2D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_2953",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_73_module_2648_2_8"
                    },
                    {
                        "class_name": "Functional",
                        "config": {
                            "input_layers": [
                                [
                                    "input_8541",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            3,
