{
    "id": "2674",
    "identity": {
        "ancestor_ids": [
            "2624",
            "2620"
        ],
        "error": null,
        "experiment_version": "jenkinsfull.er.fresh.weekend.omniglot.tf.7",
        "id": "2674",
        "unique_id": "2674"
    },
    "interpretation": {
        "description": {
            "toolkit": "TFKeras"
        },
        "global_hyperparameters": {
            "id": "2674",
            "learning_rate": 0.0006326151548464412
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Functional",
            "config": {
                "input_layers": [
                    [
                        "constant_input",
                        0,
                        0
                    ],
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_01_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_02_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_03_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_04_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_05_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_06_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_07_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_08_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_09_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_10_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_11_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_12_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_13_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_14_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_15_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_16_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_17_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_18_term_00",
                        0,
                        0
                    ],
                    [
                        "input_task_19_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_01_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_01_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_02_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_02_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_03_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_03_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_04_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_04_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_05_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_05_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_06_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_06_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_07_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_07_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_08_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_08_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_09_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_09_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_10_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_10_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_11_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_11_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_12_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_12_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_13_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_13_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_14_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_14_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_15_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_15_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_16_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_16_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_17_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_17_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_18_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_18_term_00"
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                105,
                                105,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_task_19_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_19_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_00_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_00_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_01_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_01_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_01_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_02_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_02_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_02_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_03_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_03_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_03_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_04_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_04_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_04_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_05_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_05_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_05_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_06_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_06_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_06_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_07_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_07_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_07_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_08_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_08_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_08_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_09_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_09_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_09_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_10_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_10_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_10_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_11_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_11_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_11_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_12_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_12_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_12_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_13_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_13_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_13_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_14_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_14_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_14_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_15_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_15_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_15_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_16_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_16_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_16_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_17_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_17_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_17_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_18_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_18_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_18_term_00"
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "dtype": "float32",
                            "name": "reshape1_enc_task_19_term_00",
                            "target_shape": [
                                105,
                                105,
                                1,
                                1
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_19_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "reshape1_enc_task_19_term_00"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_180",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    62
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_180"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_181",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    62
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_01_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_181"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_182",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    62
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_02_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_182"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_183",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    62
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_03_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_183"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_184",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    62
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_04_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_184"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_185",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    62
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_05_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_185"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_186",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    62
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_06_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_186"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_187",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    62
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_07_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_187"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_188",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    62
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_08_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "zero_padding3d_188"
                    },
                    {
                        "class_name": "ZeroPadding3D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "zero_padding3d_189",
                            "padding": [
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    0
                                ],
                                [
                                    0,
                                    62
                                ]
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape1_enc_task_09_term_00",
