{
    "id": "2627",
    "identity": {
        "ancestor_ids": [
            "2550",
            "2490"
        ],
        "error": null,
        "experiment_version": "garrett_pmlb_high_performance_config_202106241441",
        "id": "2627",
        "unique_id": "2627"
    },
    "interpretation": {
        "description": {
            "toolkit": "Keras"
        },
        "global_hyperparameters": {
            "id": "2627",
            "learning_rate": 0.00033557959604957674
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Functional",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                14
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "ragged": false,
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "linear",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "dtype": "float32",
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "dense_778",
                            "trainable": true,
                            "units": 84,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "dense_778"
                    },
                    {
                        "class_name": "Functional",
                        "config": {
                            "input_layers": [
                                [
                                    "input_7345",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            84
                                        ],
                                        "dtype": "float32",
                                        "name": "input_7345",
                                        "ragged": false,
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_7345"
                                },
                                {
                                    "class_name": "Dense",
                                    "config": {
                                        "activation": "elu",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dtype": "float32",
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "GlorotUniform",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1",
                                            "config": {
                                                "l1": 8.330232958542183e-05
                                            }
                                        },
                                        "name": "layer_4_Dense_0",
                                        "trainable": true,
                                        "units": 168,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_7345",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_4_Dense_0"
                                },
                                {
                                    "class_name": "Dense",
                                    "config": {
                                        "activation": "relu",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dtype": "float32",
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "GlorotNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1",
                                            "config": {
                                                "l1": 9.678429705672897e-06
                                            }
                                        },
                                        "name": "layer_3_Dense_0",
                                        "trainable": true,
                                        "units": 166,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_4_Dense_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_Dense_0"
                                },
                                {
                                    "class_name": "Dense",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dtype": "float32",
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "HeUniform",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L2",
                                            "config": {
                                                "l2": 9.456789484829642e-08
                                            }
                                        },
                                        "name": "Dense",
                                        "trainable": true,
                                        "units": 84,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_Dense_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Dense"
                                }
                            ],
                            "name": "model_3_module_2407_31_6",
                            "output_layers": [
                                [
                                    "Dense",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "dense_778",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_3_module_2407_31_6"
                    },
                    {
                        "class_name": "Functional",
                        "config": {
                            "input_layers": [
                                [
                                    "input_7344",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            84
                                        ],
                                        "dtype": "float32",
                                        "name": "input_7344",
                                        "ragged": false,
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_7344"
                                },
                                {
                                    "class_name": "Dropout",
                                    "config": {
                                        "dtype": "float32",
                                        "name": "layer_3_Dropout_0",
                                        "noise_shape": null,
                                        "rate": 0.4168349576911518,
                                        "seed": null,
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_7344",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_Dropout_0"
                                },
                                {
                                    "class_name": "Dense",
                                    "config": {
                                        "activation": "elu",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dtype": "float32",
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "GlorotNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1",
                                            "config": {
                                                "l1": 7.986169657669961e-05
                                            }
                                        },
                                        "name": "layer_4_Dense_0",
                                        "trainable": true,
                                        "units": 88,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_7344",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_4_Dense_0"
                                },
                                {
                                    "class_name": "Concatenate",
                                    "config": {
                                        "axis": -1,
                                        "dtype": "float32",
                                        "name": "merge_layer_3_layer_4",
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_Dropout_0",
                                                0,
                                                0,
                                                {}
                                            ],
                                            [
                                                "layer_4_Dense_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "merge_layer_3_layer_4"
                                },
                                {
                                    "class_name": "Dense",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dtype": "float32",
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "HeUniform",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L2",
                                            "config": {
                                                "l2": 9.456789484829642e-08
                                            }
                                        },
                                        "name": "Dense",
                                        "trainable": true,
                                        "units": 84,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "merge_layer_3_layer_4",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Dense"
                                }
                            ],
                            "name": "model_2_module_1699_170_8",
                            "output_layers": [
                                [
                                    "Dense",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "dense_778",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_2_module_1699_170_8"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "dtype": "float32",
                            "name": "add_softmod_task_00_node_04",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_3_module_2407_31_6",
                                    1,
                                    0,
                                    {}
                                ],
                                [
                                    "model_2_module_1699_170_8",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_softmod_task_00_node_04"
                    },
                    {
                        "class_name": "Functional",
                        "config": {
                            "input_layers": [
                                [
                                    "input_7345",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            84
                                        ],
                                        "dtype": "float32",
                                        "name": "input_7345",
                                        "ragged": false,
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_7345"
                                },
                                {
                                    "class_name": "Dense",
                                    "config": {
                                        "activation": "elu",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dtype": "float32",
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "GlorotUniform",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1",
                                            "config": {
                                                "l1": 8.330232958542183e-05
                                            }
                                        },
                                        "name": "layer_4_Dense_0",
                                        "trainable": true,
                                        "units": 168,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_7345",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_4_Dense_0"
                                },
                                {
                                    "class_name": "Dense",
                                    "config": {
                                        "activation": "relu",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dtype": "float32",
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "GlorotNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1",
                                            "config": {
                                                "l1": 9.678429705672897e-06
                                            }
                                        },
                                        "name": "layer_3_Dense_0",
                                        "trainable": true,
                                        "units": 166,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_4_Dense_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_Dense_0"
                                },
                                {
                                    "class_name": "Dense",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dtype": "float32",
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "HeUniform",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L2",
                                            "config": {
                                                "l2": 9.456789484829642e-08
                                            }
                                        },
                                        "name": "Dense",
                                        "trainable": true,
                                        "units": 84,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_Dense_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Dense"
                                }
                            ],
                            "name": "model_3_module_2407_31_4",
                            "output_layers": [
                                [
                                    "Dense",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_softmod_task_00_node_04",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_3_module_2407_31_4"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "dtype": "float32",
                            "name": "add_softmod_task_00_node_03",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_3_module_2407_31_4",
                                    1,
                                    0,
                                    {}
                                ],
                                [
                                    "model_3_module_2407_31_6",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_softmod_task_00_node_03"
                    },
                    {
                        "class_name": "Functional",
                        "config": {
                            "input_layers": [
                                [
                                    "input_7346",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            84
                                        ],
                                        "dtype": "float32",
                                        "name": "input_7346",
                                        "ragged": false,
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_7346"
                                },
                                {
                                    "class_name": "Dense",
                                    "config": {
                                        "activation": "relu",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dtype": "float32",
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "HeNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L2",
                                            "config": {
                                                "l2": 3.1091676078176533e-07
                                            }
                                        },
                                        "name": "layer_3_Dense_0",
                                        "trainable": true,
                                        "units": 106,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_7346",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_Dense_0"
                                },
                                {
                                    "class_name": "Dense",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dtype": "float32",
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "HeUniform",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L2",
                                            "config": {
                                                "l2": 9.456789484829642e-08
                                            }
                                        },
                                        "name": "Dense",
                                        "trainable": true,
                                        "units": 84,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_Dense_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Dense"
                                }
                            ],
                            "name": "model_4_module_2393_2_3",
                            "output_layers": [
                                [
                                    "Dense",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_softmod_task_00_node_03",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_4_module_2393_2_3"
                    },
                    {
                        "class_name": "Functional",
                        "config": {
                            "input_layers": [
                                [
                                    "input_7346",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            84
                                        ],
                                        "dtype": "float32",
                                        "name": "input_7346",
                                        "ragged": false,
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_7346"
                                },
                                {
                                    "class_name": "Dense",
                                    "config": {
                                        "activation": "relu",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dtype": "float32",
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "HeNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L2",
                                            "config": {
                                                "l2": 3.1091676078176533e-07
                                            }
                                        },
                                        "name": "layer_3_Dense_0",
                                        "trainable": true,
                                        "units": 106,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_7346",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_Dense_0"
                                },
                                {
                                    "class_name": "Dense",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dtype": "float32",
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "HeUniform",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L2",
                                            "config": {
                                                "l2": 9.456789484829642e-08
                                            }
                                        },
                                        "name": "Dense",
                                        "trainable": true,
                                        "units": 84,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_Dense_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Dense"
                                }
                            ],
                            "name": "model_4_module_2393_2_10",
                            "output_layers": [
                                [
                                    "Dense",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "dense_778",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_4_module_2393_2_10"
                    },
                    {
                        "class_name": "Functional",
                        "config": {
                            "input_layers": [
                                [
                                    "input_7344",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            84
                                        ],
                                        "dtype": "float32",
                                        "name": "input_7344",
                                        "ragged": false,
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_7344"
                                },
                                {
                                    "class_name": "Dropout",
                                    "config": {
                                        "dtype": "float32",
                                        "name": "layer_3_Dropout_0",
                                        "noise_shape": null,
                                        "rate": 0.4168349576911518,
                                        "seed": null,
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_7344",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_Dropout_0"
                                },
                                {
                                    "class_name": "Dense",
                                    "config": {
                                        "activation": "elu",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dtype": "float32",
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "GlorotNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1",
                                            "config": {
                                                "l1": 7.986169657669961e-05
                                            }
                                        },
                                        "name": "layer_4_Dense_0",
                                        "trainable": true,
                                        "units": 88,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_7344",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_4_Dense_0"
                                },
